package days02;

/**
 * @author dewbuster
 * @date 2024. 7. 2. - 오후 5:30:20
 * @subject 음수 표현
 * @content
 *
 */
public class Ex05_05 {

	public static void main(String[] args) {
		
		/*
		 * [ -10 ]
		 * 1) 부호와 절대치
		 * [0][0][0][0]...[1][0][1][0]    10
		 * [1][0][0][0]...[1][0][1][0]   -10
		 * 2) 1의 보수법
		 * 3) 2의 보수법 (현재)
		 *     -10
		 *     ㄱ. 절대치: |-10|   10
		 *          0000 ... 1010
		 *     ㄴ. 1의 보수
		 *          1111 ... 0101
		 *     ㄷ. 1을 더한다
		 *          1111 ... 0101 +
		 *          0000 ... 0001
		 *        =1111 ... 0110
		 */

	}

}
